In [1]:
import pandas as pd
df = pd.read_csv('data/titanic.csv')
df = df[['Survived','Pclass','Sex','Age','Embarked']]
df = df.dropna()
df.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [2]:
len(df)

1044

# 그룹의 통계값 계산하기

* <b>df.groupby(그룹기준컬럼).통계적용컬럼.통계함수</b>
* count() : 누락값을 제외한 데이터 수
* size() : 누락값을 포함한 데이터 수
* mean() : 평균
* sum() : 합계
* std() : 표준편차
* min() : 최소값
* max() : 최대값
* sum() : 전체 합

## 객실등급별 생존 통계

In [5]:
# 객실등급(Pclass)별 승선자 수를 구한 결과를 데이터프레임 df1로 만들기
df1 = df.groupby('Pclass').Survived.count().to_frame()
df1

        Survived
Pclass
1            282
2            261
3            501

In [7]:
# 객실등급(Pclass)별 생존자 수를 구한 결과를 데이터프레임 df2로 만들기
df2 = df.groupby('Pclass').Survived.sum().to_frame()
df2

        Survived
Pclass
1            168
2            112
3            135

In [10]:
# 객실등급(Pclass)별 생존율 구한 결과를 데이터프레임 df3으로 만들기
df3 = df.groupby('Pclass').Survived.mean().to_frame()
df3

        Survived
Pclass
1       0.595745
2       0.429119
3       0.269461

In [15]:
# 객실등급(Pclass)별 탑승자수, 생존자수, 생존율 데이터프레임을 df4로 만들기
df4 = pd.concat([df1,df2,df3],axis=1)
df4
df4.columns=['탑승자수','생존자수','생존율']
df4

        탑승자수  생존자수       생존율
Pclass
1        282   168  0.595745
2        261   112  0.429119
3        501   135  0.269461

## 성별 생존 통계

In [17]:
df.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [26]:
# 성별 승선자 수 데이터프레임을 df5로 만들기
df5 = df.groupby('Sex').Survived.count().to_frame()
df5

        Survived
Sex
female       386
male         658

In [27]:
# 성별 생존자 수 데이터프레임을 df6으로 만들기
df6 = df.groupby('Sex').Survived.sum().to_frame()
df6

        Survived
Sex
female       322
male          93

In [28]:
# 성별 생존율 데이터프레임을 df7로 만들기
df7 = df.groupby('Sex').Survived.mean().to_frame()
df7

        Survived
Sex
female  0.834197
male    0.141337

In [31]:
# 성별 탑승자수, 생존자수, 생존율 데이터프레임을 df8로 만들기
df8 = pd.concat([df5,df6,df7],axis=1)
df8

        Survived  Survived  Survived
Sex
female       386       322  0.834197
male         658        93  0.141337

In [32]:
df8.columns=['탑승자수','생존자수','생존율']
df8

        탑승자수  생존자수       생존율
Sex
female   386   322  0.834197
male     658    93  0.141337

## 성별, 객실등급별 생존 통계

In [34]:
# 성별, 객실등급별 생존율
df.groupby(['Sex','Pclass']).Survived.mean().to_frame()

               Survived
Sex    Pclass
female 1       0.977099
       2       0.941748
       3       0.638158
male   1       0.264901
       2       0.094937
       3       0.108883

# 그룹에 사용자정의함수 적용하기
* df.groupby(그룹기준컬럼).통계적용컬럼.<b>agg(사용자정의함수,매개변수들)</b>

In [35]:
def my_mean(values):
    return sum(values)/len(values)

In [ ]:
df.groupby(['Sex','Pclass']).Survived.agg(my_mean)

# 그룹 오브젝트 출력하기
* 데이터프레임.groupby(그룹기준컬럼).<b>groups</b> --> 그룹별 인덱스:[데이터리스트] 출력<br> 
* 데이터프레임.groupby(그룹기준컬럼).<b>get_group(그룹인덱스)</b> --> 그룹별 인덱스에 해당하는 데이터프레임 출력<br>

In [36]:
df20 = df[:20]

In [38]:
df20.head()
len(df20)

20

In [41]:
# Pclass 그룹별 인덱스
df20.groupby('Pclass').groups

{1: [1, 3, 6, 11], 2: [9, 15, 20, 21], 3: [0, 2, 4, 7, 8, 10, 12, 13, 14, 16, 18, 22]}

In [42]:
# Pclass 그룹 출력(1등석)
df.groupby('Pclass').get_group(1)

      Survived  Pclass     Sex   Age Embarked
1            1       1  female  38.0        C
3            1       1  female  35.0        S
6            0       1    male  54.0        S
11           1       1  female  58.0        S
23           1       1    male  28.0        S
...        ...     ...     ...   ...      ...
1294         0       1    male  17.0        S
1295         0       1    male  43.0        C
1298         0       1    male  50.0        C
1302         1       1  female  37.0        Q
1305         1       1  female  39.0        C

[282 rows x 5 columns]

In [43]:
# Pclass 그룹 출력(2등석)
df.groupby('Pclass').get_group(2)

      Survived  Pclass     Sex   Age Embarked
9            1       2  female  14.0        C
15           1       2  female  55.0        S
20           0       2    male  35.0        S
21           1       2    male  34.0        S
33           0       2    male  66.0        S
...        ...     ...     ...   ...      ...
1278         0       2    male  57.0        S
1284         0       2    male  47.0        S
1292         0       2    male  38.0        S
1296         0       2    male  20.0        C
1297         0       2    male  23.0        S

[261 rows x 5 columns]

In [44]:
# Pclass 그룹 출력(3등석)
df.groupby('Pclass').get_group(3)

      Survived  Pclass     Sex   Age Embarked
0            0       3    male  22.0        S
2            1       3  female  26.0        S
4            0       3    male  35.0        S
7            0       3    male   2.0        S
8            1       3  female  27.0        S
...        ...     ...     ...   ...      ...
1289         0       3    male  22.0        S
1290         0       3    male  31.0        Q
1300         1       3  female   3.0        S
1303         1       3  female  28.0        S
1306         0       3    male  38.5        S

[501 rows x 5 columns]